## Collaborative Filtering

Recommender System is a system that seeks to predict or filter preferences according to the user’s choices. Recommender systems are utilized in a variety of areas including movies, music, news, books, research articles, search queries, social tags, and products in general.

Like many machine learning techniques, a recommender system makes prediction based on users’ historical behaviors. Specifically, it’s to predict user preference for a set of items based on past experience. To build a recommender system, the most two popular approaches are Content-based and Collaborative Filtering.

Recommender systems produce a list of recommendations in any of the two ways –

<img src = '0_img.png'>

1.    **Collaborative filtering**

Collaborative filtering approaches build a model from user’s past behavior (i.e. items purchased or searched by the user) as well as similar decisions made by other users. This model is then used to predict items (or ratings for items) that user may have an interest in.

Collaborative Filtering, on the other hand, doesn’t need anything else except users’ historical preference on a set of items. Because it’s based on historical data, the core assumption here is that the users who have agreed in the past tend to also agree in the future. 

2.    **Content-based filtering**

Content-based filtering approaches uses a series of discrete characteristics of an item in order to recommend additional items with similar properties. Content-based filtering methods are totally based on a description of the item and a profile of the user’s preferences. It recommends items based on user’s past preferences.

Content-based approach requires a good amount of information of items’ own features, rather than using users’ interactions and feedbacks. For example, it can be movie attributes such as genre, year, director, actor etc., or textual content of articles that can extracted by applying Natural Language Processing. 

<hr>

### __Disadvantages of Employing content-based filtering__

A few of them are:

-    content-based recommender systems tend to over-specialize. They will recommend items similar to those already consumed, with a tendency to create a “filter bubble”, leaving less possibility for expanding a user’s interests.
-    The issue of limited content analysis: If the content doesn’t contain enough information to discriminate the items precisely, the recommendation will be poor and thus hand-engineered features are required, or tags need to be assigned.

<hr>

### __What is Collaborative Filtering?__

Collaborative filtering (CF) systems work by collecting user feedback in the form of ratings for items in a given domain and exploiting similarities in rating behavior among several users in determining how to recommend an item.

CF accumulates customer product ratings, identifies customers with common ratings, and offers recommendations based on inter-customer comparisons. It’s based on the idea that people who agree in their evaluations of certain items in the past are likely to agree again in the future. For example, most people ask their trusted friends for restaurant or movie suggestions.

Collaborative filtering models are based on an assumption that people like things similar to other things they like, and things that are liked by other people with similar taste.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from scipy.sparse import csr_matrix
from sklearn.neighbors import NearestNeighbors # unsupervised learning

In [5]:
df = pd.read_csv('file.tsv', sep='\t', names=['user_id', 'item_id', 'rating', 'timestamp'])
df

        user_id  item_id  rating  timestamp
0             0       50       5  881250949
1             0      172       5  881250949
2             0      133       1  881250949
3           196      242       3  881250949
4           186      302       3  891717742
...         ...      ...     ...        ...
99998       880      476       3  880175444
99999       716      204       5  879795543
100000      276     1090       1  874795795
100001       13      225       2  882399156
100002       12      203       3  879959583

[100003 rows x 4 columns]

In [6]:
df[df['user_id'] == 0]

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949

In [7]:
movie = pd.read_csv('Movie_Id_Titles.csv')
movie.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [10]:
movie[movie['item_id'] == 133]

     item_id                      title
132      133  Gone with the Wind (1939)

In [11]:
data = pd.merge(df, movie, on='item_id')
data.head()

   user_id  item_id  rating  timestamp             title
0        0       50       5  881250949  Star Wars (1977)
1      290       50       5  880473582  Star Wars (1977)
2       79       50       4  891271545  Star Wars (1977)
3        2       50       5  888552084  Star Wars (1977)
4        8       50       5  879362124  Star Wars (1977)

In [12]:
data[data['item_id'] == 50]

     user_id  item_id  rating  timestamp             title
0          0       50       5  881250949  Star Wars (1977)
1        290       50       5  880473582  Star Wars (1977)
2         79       50       4  891271545  Star Wars (1977)
3          2       50       5  888552084  Star Wars (1977)
4          8       50       5  879362124  Star Wars (1977)
..       ...      ...     ...        ...               ...
579      749       50       5  878846978  Star Wars (1977)
580      886       50       5  876031501  Star Wars (1977)
581      739       50       4  886958895  Star Wars (1977)
582      903       50       5  891031329  Star Wars (1977)
583      780       50       5  891363685  Star Wars (1977)

[584 rows x 5 columns]

In [24]:
data.groupby('title').count()['rating'].sort_values(ascending=False)

title
Star Wars (1977)                              584
Contact (1997)                                509
Fargo (1996)                                  508
Return of the Jedi (1983)                     507
Liar Liar (1997)                              485
                                             ...
Man from Down Under, The (1943)                 1
Marlene Dietrich: Shadow and Light (1996)       1
Mat' i syn (1997)                               1
Mille bolle blu (1993)                          1
Á köldum klaka (Cold Fever) (1994)              1
Name: rating, Length: 1664, dtype: int64

In [25]:
ratings = pd.DataFrame(data.groupby('title')['rating'].mean())

ratings['num_of_ratings'] = pd.DataFrame(data.groupby('title')['rating'].count())
ratings

                                         rating  num_of_ratings
title
'Til There Was You (1997)              2.333333               9
1-900 (1994)                           2.600000               5
101 Dalmatians (1996)                  2.908257             109
12 Angry Men (1957)                    4.344000             125
187 (1997)                             3.024390              41
...                                         ...             ...
Young Guns II (1990)                   2.772727              44
Young Poisoner's Handbook, The (1995)  3.341463              41
Zeus and Roxanne (1997)                2.166667               6
unknown                                3.444444               9
Á köldum klaka (Cold Fever) (1994)     3.000000               1

[1664 rows x 2 columns]

In [28]:
ratings.reset_index()

                                      title    rating  num_of_ratings
0                 'Til There Was You (1997)  2.333333               9
1                              1-900 (1994)  2.600000               5
2                     101 Dalmatians (1996)  2.908257             109
3                       12 Angry Men (1957)  4.344000             125
4                                187 (1997)  3.024390              41
...                                     ...       ...             ...
1659                   Young Guns II (1990)  2.772727              44
1660  Young Poisoner's Handbook, The (1995)  3.341463              41
1661                Zeus and Roxanne (1997)  2.166667               6
1662                                unknown  3.444444               9
1663     Á köldum klaka (Cold Fever) (1994)  3.000000               1

[1664 rows x 3 columns]